function y=ID_polarTogenera(u)
%----逆动力学控制中，给定左前腿和右前腿的极坐标位置和速度，计算出相应广义关节速度、加速度----%
global L1 L2

P_polar=u(1:2);Pd_polar=u(3:4);
r=P_polar(1);
theta=P_polar(2);

q2=acos((L1^2+L2^2-r^2)/(2*L1*L2))-pi;
q1=asin((L2*sin(pi+q2))/r)+theta;
Q=[q1;q2];

J11=-((3*(1 - ((125*r^2)/27 - 61/60)^2)^(1/2))/(10*r^2) + (25*((125*r^2)/27 - 61/60))/(9*(1 - ((125*r^2)/27 - 61/60)^2)^(1/2)))/((9*((125*r^2)/27 - 61/60)^2 - 9)/(100*r^2) + 1)^(1/2);
J12=1;
J21=(250*r)/(27*(1 - ((125*r^2)/27 - 61/60)^2)^(1/2));
J22=0;
Jpolartogen=[J11,J12;J21,J22];
Qd=Jpolartogen*Pd_polar;
y=[Q;Qd];
